# チョイスズ・マッピングス（Choices Mappings；選択肢の紐づけ）
extends Node


# 選択肢と飛び先
#
# 	- この `choices_mappings` という変数名は変えないでください
#	- ファイル名は変えても構いません
#	- `📗～部門` ノードにぶら下がっているファイルを読みに行きます
#
var choices_mappings = {

	# このキーは［段落名］と呼ぶことにします
	#
	#	- 頭に「¶」を付けているのは見やすさのためで、付けなくても構いません
	#	- `📗～部門` ノードにぶら下がっている他のファイルの `choices_mappings` のセクション名と被らないように運用してください
	#
	"¶タイトル画面" : {
		# 選択肢の行番号と、移動先の［セクション名］
		1 : "¶はじまり",
		2 : "¶終了",
	},
	"¶北海道" : {
		&"VK_Ok" : "¶確定",
		&"VK_Down" : {
			# レバーは + - も指定
			&"+" : "¶青森県",
		},
	},
	"¶青森県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Down" : {
			&"-" : "¶北海道",
			&"+" : "¶秋田県",
		},
		# TODO ナナメ入力を指定する方法が必要
		4 : "¶岩手県",
	},
	"¶秋田県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"+" : "¶岩手県",
		},
		&"VK_Down" : {
			&"-" : "¶青森県",
			&"+" : "¶山形県",
		},
		# TODO ナナメ入力を指定する方法が必要
		4 : "¶宮城県",
	},
	"¶岩手県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶秋田県",
		},
		&"VK_Down" : {
			&"-" : "¶青森県",
			&"+" : "¶宮城県",
		},
	},
	"¶山形県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶新潟県",
			&"+" : "¶宮城県",
		},
		&"VK_Down" : {
			&"-" : "¶秋田県",
			&"+" : "¶福島県",
		},
	},
	"¶宮城県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶山形県",
		},
		&"VK_Down" : {
			&"-" : "¶岩手県",
			&"+" : "¶福島県",
		},
		# TODO ナナメ入力を指定する方法が必要
		5 : "¶秋田県",
	},
	"¶福島県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶新潟県",
		},
		&"VK_Down" : {
			&"-" : "¶山形県",
			&"+" : "¶栃木県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶宮城県",
		4 : "¶茨城県",
		6 : "¶群馬県",
	},
	"¶群馬県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶長野県",
			&"+" : "¶栃木県",
		},
		&"VK_Down" : {
			&"-" : "¶新潟県",
			&"+" : "¶埼玉県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶福島県",
	},
	"¶栃木県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶群馬県",
			&"+" : "¶茨城県",
		},
		&"VK_Down" : {
			&"-" : "¶福島県",
			&"+" : "¶埼玉県",
		},
	},
	"¶茨城県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶栃木県",
		},
		&"VK_Down" : {
			&"-" : "¶福島県",
			&"+" : "¶千葉県",
		},
		# TODO ナナメ入力を指定する方法が必要
		4 : "¶埼玉県",
	},
	"¶千葉県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶東京都",
		},
		&"VK_Down" : {
			&"-" : "¶茨城県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶神奈川県",
		5 : "¶埼玉県",
	},
	"¶埼玉県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶長野県",
			&"+" : "¶茨城県",
		},
		&"VK_Down" : {
			&"-" : "¶群馬県",
			&"+" : "¶東京都",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶栃木県",
		5 : "¶千葉県",
		7 : "¶山梨県",
	},
	"¶東京都" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶山梨県",
			&"+" : "¶千葉県",
		},
		&"VK_Down" : {
			&"-" : "¶埼玉県",
			&"+" : "¶神奈川県",
		},
	},
	"¶神奈川県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶山梨県",
			&"+" : "¶千葉県",
		},
		&"VK_Down" : {
			&"-" : "¶東京都",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶静岡県",
	},
	"¶新潟県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶富山県",
			&"+" : "¶福島県",
		},
		&"VK_Down" : {
			&"-" : "¶群馬県",
		},
		# TODO ナナメ入力を指定する方法が必要
		2 : "¶山形県",
		5 : "¶長野県",
	},
	"¶長野県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶岐阜県",
			&"+" : "¶埼玉県",
		},
		&"VK_Down" : {
			&"-" : "¶新潟県",
			&"+" : "¶静岡県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶群馬県",
		5 : "¶山梨県",
		7 : "¶愛知県",
		9 : "¶富山県",
	},
	"¶富山県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶石川県",
			&"+" : "¶長野県",
		},
		&"VK_Down" : {
			&"+" : "¶岐阜県",
		},
		# TODO ナナメ入力を指定する方法が必要
		2 : "¶新潟県",
	},
	"¶石川県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"+" : "¶富山県",
		},
		&"VK_Down" : {
			&"+" : "¶福井県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶岐阜県",
	},
	"¶福井県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶京都府",
			&"+" : "¶岐阜県",
		},
		&"VK_Down" : {
			&"-" : "¶石川県",
			&"+" : "¶滋賀県",
		},
	},
	"¶岐阜県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶福井県",
			&"+" : "¶長野県",
		},
		&"VK_Down" : {
			&"-" : "¶富山県",
			&"+" : "¶三重県",
		},
		# TODO ナナメ入力を指定する方法が必要
		4 : "¶愛知県",
		6 : "¶滋賀県",
		8 : "¶石川県",
	},
	"¶山梨県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"+" : "¶東京都",
		},
		&"VK_Down" : {
			&"+" : "¶静岡県",
		},
		# TODO ナナメ入力を指定する方法が必要
		2 : "¶埼玉県",
		4 : "¶神奈川県",
		6 : "¶長野県",
	},
	"¶静岡県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶愛知県",
		},
		&"VK_Down" : {
			&"-" : "¶山梨県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶神奈川県",
		5 : "¶長野県",
	},
	"¶愛知県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶三重県",
			&"+" : "¶静岡県",
		},
		&"VK_Down" : {
			&"-" : "¶岐阜県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶長野県",
	},
	"¶滋賀県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶京都府",
			&"+" : "¶岐阜県",
		},
		&"VK_Down" : {
			&"-" : "¶福井県",
			&"+" : "¶三重県",
		},
	},
	"¶京都府" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶兵庫県",
			&"+" : "¶滋賀県",
		},
		&"VK_Down" : {
			&"+" : "¶奈良県",
		},
		# TODO ナナメ入力を指定する方法が必要
		2 : "¶福井県",
		4 : "¶三重県",
		6 : "¶大阪府",
	},
	"¶兵庫県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Down" : {
			&"+" : "¶徳島県",
		},
		# TODO ナナメ入力を指定する方法が必要
		2 : "¶京都府",
		3 : "¶大阪府",
		5 : "¶岡山県",
		6 : "¶鳥取県",
	},
	"¶三重県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶奈良県",
			&"+" : "¶愛知県",
		},
		&"VK_Down" : {
			&"+" : "¶滋賀県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶岐阜県",
		5 : "¶和歌山県",
		7 : "¶京都府",
	},
	"¶奈良県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶大阪府",
			&"+" : "¶三重県",
		},
		&"VK_Down" : {
			&"+" : "¶京都府",
		},
		# TODO ナナメ入力を指定する方法が必要
		4 : "¶和歌山県",
	},
	"¶和歌山県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"+" : "¶三重県",
		},
		&"VK_Down" : {
			&"+" : "¶大阪府",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶奈良県",
	},
	"¶大阪府" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"+" : "¶奈良県",
		},
		&"VK_Down" : {
			&"-" : "¶京都府",
			&"+" : "¶和歌山県",
		},
		# TODO ナナメ入力を指定する方法が必要
		5 : "¶兵庫県",
	},
	"¶鳥取県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶島根県",
			&"+" : "¶兵庫県",
		},
		&"VK_Down" : {
			&"+" : "¶岡山県",
		},
		# TODO ナナメ入力を指定する方法が必要
		4 : "¶広島県",
	},
	"¶島根県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶山口県",
			&"+" : "¶鳥取県",
		},
		&"VK_Down" : {
			&"+" : "¶広島県",
		},
	},
	"¶山口県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"+" : "¶広島県",
		},
		# TODO ナナメ入力を指定する方法が必要
		2 : "¶鳥取県",
		4 : "¶福岡県",
	},
	"¶岡山県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶広島県",
			&"+" : "¶兵庫県",
		},
		&"VK_Down" : {
			&"-" : "¶鳥取県",
			&"+" : "¶香川県",
		},
	},
	"¶広島県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶山口県",
			&"+" : "¶岡山県",
		},
		&"VK_Down" : {
			&"-" : "¶島根県",
			&"+" : "¶愛媛県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶鳥取県",
	},
	"¶香川県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶愛媛県",
		},
		&"VK_Down" : {
			&"-" : "¶岡山県",
			&"+" : "¶徳島県",
		},
	},
	"¶徳島県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶愛媛県",
		},
		&"VK_Down" : {
			&"-" : "¶香川県",
			&"+" : "¶高知県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶兵庫県",
	},
	"¶愛媛県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"+" : "¶徳島県",
		},
		&"VK_Down" : {
			&"-" : "¶広島県",
			&"+" : "¶高知県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶香川県",
	},
	"¶高知県" : {
		&"VK_Ok" : "¶確定",
		# TODO ナナメ入力を指定する方法が必要
		2 : "¶徳島県",
		3 : "¶愛媛県",
	},
	"¶福岡県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶佐賀県",
			&"+" : "¶大分県",
		},
		&"VK_Down" : {
			&"-" : "¶山口県",
			&"+" : "¶熊本県",
		},
	},
	"¶佐賀県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"+" : "¶福岡県",
		},
		&"VK_Down" : {
			&"+" : "¶長崎県",
		},
	},
	"¶長崎県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Down" : {
			&"-" : "¶佐賀県",
		},
	},
	"¶大分県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶福岡県",
		},
		&"VK_Down" : {
			&"+" : "¶宮崎県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶熊本県",
	},
	"¶熊本県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"+" : "¶宮城県",
		},
		&"VK_Down" : {
			&"-" : "¶福岡県",
			&"+" : "¶鹿児島県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶大分県",
	},
	"¶宮崎県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Right" : {
			&"-" : "¶熊本県",
		},
		&"VK_Down" : {
			&"-" : "¶大分県",
			&"+" : "¶鹿児島県",
		},
	},
	"¶鹿児島県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Down" : {
			&"-" : "¶熊本県",
			&"+" : "¶沖縄県",
		},
		# TODO ナナメ入力を指定する方法が必要
		3 : "¶宮崎県",
	},
	"¶沖縄県" : {
		&"VK_Ok" : "¶確定",
		&"VK_Down" : {
			&"-" : "¶鹿児島県",
		},
	},
	"¶崎川市最強振興会館" : {
		1 : "¶６筋の７段目の駒を６段目に突く",
		2 : "¶角道を止める",
	},
}
