# チョイスズ・マッピングス（Choices Mappings；選択肢の紐づけ）
extends Node


# 選択肢と飛び先
#
# 	- この `choices_mappings` という変数名は変えないでください
#	- ファイル名は変えても構いません
#	- `📗～部門` ノードにぶら下がっているファイルを読みに行きます
#
var choices_mappings = {

	# このキーは［段落名］と呼ぶことにします
	#
	#	- 頭に「¶」を付けているのは見やすさのためで、付けなくても構いません
	#	- `📗～部門` ノードにぶら下がっている他のファイルの `choices_mappings` のセクション名と被らないように運用してください
	#
	"¶タイトル画面" : {
		# 選択肢の行番号と、移動先の［セクション名］
		1 : "¶はじまり",
		2 : "¶終了",
	},
	"¶北海道" : {
		# TODO ボタンの押下状態や、レバーの整数値によって、飛び先を制御したい
		1 : "¶確定",
		2 : "¶青森県",
		# TODO 以下は例。レバーは + - も指定
		&"VK_Ok" : "¶確定",
		&"VK_Down" : {
			&"+" : "¶青森県",
		},
	},
	"¶青森県" : {
		1 : "¶確定",
		2 : "¶北海道",
		3 : "¶秋田県",
		4 : "¶岩手県",
	},
	"¶秋田県" : {
		1 : "¶確定",
		2 : "¶青森県",
		3 : "¶岩手県",
		4 : "¶宮城県",
		5 : "¶山形県",
	},
	"¶岩手県" : {
		1 : "¶確定",
		2 : "¶青森県",
		3 : "¶宮城県",
		4 : "¶秋田県",
	},
	"¶山形県" : {
		1 : "¶確定",
		2 : "¶秋田県",
		3 : "¶宮城県",
		4 : "¶福島県",
		5 : "¶新潟県",
	},
	"¶宮城県" : {
		1 : "¶確定",
		2 : "¶岩手県",
		3 : "¶福島県",
		4 : "¶山形県",
		5 : "¶秋田県",
	},
	"¶福島県" : {
		1 : "¶確定",
		2 : "¶山形県",
		3 : "¶宮城県",
		4 : "¶茨城県",
		5 : "¶栃木県",
		6 : "¶群馬県",
		7 : "¶新潟県",
	},
	"¶群馬県" : {
		1 : "¶確定",
		2 : "¶新潟県",
		3 : "¶福島県",
		4 : "¶栃木県",
		5 : "¶埼玉県",
		6 : "¶長野県",
	},
	"¶栃木県" : {
		1 : "¶確定",
		2 : "¶福島県",
		3 : "¶茨城県",
		4 : "¶埼玉県",
		5 : "¶群馬県",
	},
	"¶茨城県" : {
		1 : "¶確定",
		2 : "¶福島県",
		3 : "¶千葉県",
		4 : "¶埼玉県",
		5 : "¶栃木県",
	},
	"¶千葉県" : {
		1 : "¶確定",
		2 : "¶茨城県",
		3 : "¶神奈川県",
		4 : "¶東京都",
		5 : "¶埼玉県",
	},
	"¶埼玉県" : {
		1 : "¶確定",
		2 : "¶群馬県",
		3 : "¶栃木県",
		4 : "¶茨城県",
		5 : "¶千葉県",
		6 : "¶東京都",
		7 : "¶山梨県",
		8 : "¶長野県",
	},
	"¶東京都" : {
		1 : "¶確定",
		2 : "¶埼玉県",
		3 : "¶千葉県",
		4 : "¶神奈川県",
		5 : "¶山梨県",
	},
	"¶神奈川県" : {
		1 : "¶確定",
		2 : "¶東京都",
		3 : "¶静岡県",
		4 : "¶山梨県",
	},
	"¶新潟県" : {
		1 : "¶確定",
		2 : "¶山形県",
		3 : "¶福島県",
		4 : "¶群馬県",
		5 : "¶長野県",
		6 : "¶富山県",
	},
	"¶長野県" : {
		1 : "¶確定",
		2 : "¶新潟県",
		3 : "¶群馬県",
		4 : "¶埼玉県",
		5 : "¶山梨県",
		6 : "¶静岡県",
		7 : "¶愛知県",
		8 : "¶岐阜県",
		9 : "¶富山県",
	},
	"¶富山県" : {
		1 : "¶確定",
		2 : "¶新潟県",
		3 : "¶長野県",
		4 : "¶岐阜県",
		5 : "¶石川県",
	},
	"¶石川県" : {
		1 : "¶確定",
		2 : "¶富山県",
		3 : "¶岐阜県",
		4 : "¶福井県",
	},
	"¶福井県" : {
		1 : "¶確定",
		2 : "¶石川県",
		3 : "¶岐阜県",
		4 : "¶滋賀県",
		5 : "¶京都府",
	},
	"¶岐阜県" : {
		1 : "¶確定",
		2 : "¶富山県",
		3 : "¶長野県",
		4 : "¶愛知県",
		5 : "¶三重県",
		6 : "¶滋賀県",
		7 : "¶福井県",
		8 : "¶石川県",
	},
	"¶山梨県" : {
		1 : "¶確定",
		2 : "¶埼玉県",
		3 : "¶東京都",
		4 : "¶神奈川県",
		5 : "¶静岡県",
		6 : "¶長野県",
	},
	"¶静岡県" : {
		1 : "¶確定",
		2 : "¶山梨県",
		3 : "¶神奈川県",
		4 : "¶愛知県",
		5 : "¶長野県",
	},
	"¶愛知県" : {
		1 : "¶確定",
		2 : "¶岐阜県",
		3 : "¶長野県",
		4 : "¶静岡県",
		5 : "¶三重県",
	},
	"¶滋賀県" : {
		1 : "¶確定",
		2 : "¶福井県",
		3 : "¶岐阜県",
		4 : "¶三重県",
		5 : "¶京都府",
	},
	"¶京都府" : {
		1 : "¶確定",
		2 : "¶福井県",
		3 : "¶滋賀県",
		4 : "¶三重県",
		5 : "¶奈良県",
		6 : "¶大阪府",
		7 : "¶兵庫県",
	},
	"¶兵庫県" : {
		1 : "¶確定",
		2 : "¶京都府",
		3 : "¶大阪府",
		4 : "¶徳島県",
		5 : "¶岡山県",
		6 : "¶鳥取県",
	},
	"¶三重県" : {
		1 : "¶確定",
		2 : "¶滋賀県",
		3 : "¶岐阜県",
		4 : "¶愛知県",
		5 : "¶和歌山県",
		6 : "¶奈良県",
		7 : "¶京都府",
	},
	"¶奈良県" : {
		1 : "¶確定",
		2 : "¶京都府",
		3 : "¶三重県",
		4 : "¶和歌山県",
		5 : "¶大阪府",
	},
	"¶和歌山県" : {
		1 : "¶確定",
		2 : "¶大阪府",
		3 : "¶奈良県",
		4 : "¶三重県",
	},
	"¶大阪府" : {
		1 : "¶確定",
		2 : "¶京都府",
		3 : "¶奈良県",
		4 : "¶和歌山県",
		5 : "¶兵庫県",
	},
	"¶鳥取県" : {
		1 : "¶確定",
		2 : "¶兵庫県",
		3 : "¶岡山県",
		4 : "¶広島県",
		5 : "¶島根県",
	},
	"¶島根県" : {
		1 : "¶確定",
		2 : "¶鳥取県",
		3 : "¶広島県",
		4 : "¶山口県",
	},
	"¶山口県" : {
		1 : "¶確定",
		2 : "¶鳥取県",
		3 : "¶広島県",
		4 : "¶福岡県",
	},
	"¶岡山県" : {
		1 : "¶確定",
		2 : "¶鳥取県",
		3 : "¶兵庫県",
		4 : "¶香川県",
		5 : "¶広島県",
	},
	"¶広島県" : {
		1 : "¶確定",
		2 : "¶島根県",
		3 : "¶鳥取県",
		4 : "¶岡山県",
		5 : "¶愛媛県",
		6 : "¶山口県",
	},
	"¶香川県" : {
		1 : "¶確定",
		2 : "¶岡山県",
		3 : "¶徳島県",
		4 : "¶愛媛県",
	},
	"¶徳島県" : {
		1 : "¶確定",
		2 : "¶香川県",
		3 : "¶兵庫県",
		4 : "¶高知県",
		5 : "¶愛媛県",
	},
	"¶愛媛県" : {
		1 : "¶確定",
		2 : "¶広島県",
		3 : "¶香川県",
		4 : "¶徳島県",
		5 : "¶高知県",
	},
	"¶高知県" : {
		1 : "¶確定",
		2 : "¶徳島県",
		3 : "¶愛媛県",
	},
	"¶福岡県" : {
		1 : "¶確定",
		2 : "¶山口県",
		3 : "¶大分県",
		4 : "¶熊本県",
		5 : "¶佐賀県",
	},
	"¶佐賀県" : {
		1 : "¶確定",
		2 : "¶福岡県",
		3 : "¶長崎県",
	},
	"¶長崎県" : {
		1 : "¶確定",
		2 : "¶佐賀県",
	},
	"¶大分県" : {
		1 : "¶確定",
		2 : "¶宮崎県",
		3 : "¶熊本県",
		4 : "¶福岡県",
	},
	"¶熊本県" : {
		1 : "¶確定",
		2 : "¶福岡県",
		3 : "¶大分県",
		4 : "¶宮城県",
		5 : "¶鹿児島県",
	},
	"¶宮崎県" : {
		1 : "¶確定",
		2 : "¶大分県",
		3 : "¶鹿児島県",
		4 : "¶熊本県",
	},
	"¶鹿児島県" : {
		1 : "¶確定",
		2 : "¶熊本県",
		3 : "¶宮崎県",
		4 : "¶沖縄県",
	},
	"¶沖縄県" : {
		1 : "¶確定",
		2 : "¶鹿児島県",
	},
	"¶崎川市最強振興会館" : {
		1 : "¶６筋の７段目の駒を６段目に突く",
		2 : "¶角道を止める",
	},
}
